projects/alpine/prototype/M32/test/java/files/alpine/soap/valid/soap11/rpcenc.xml

<!--
POST /StockQuote HTTP/1.1
Host: www.stockquoteserver.com
Content-Type: text/xml; charset="utf-8"
Content-Length: nnnn
SOAPAction: "Some-URI"
-->

<soap:Envelope
  xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<soap:Body>
  <m:GetLastTradePriceDetailed
    xmlns:m="http://example.org/Some-URI">
    <Symbol>DEF</Symbol>
    <Company>DEF Corp</Company>
    <Price>34.1</Price>
  </m:GetLastTradePriceDetailed>
</soap:Body>
</soap:Envelope>